; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	infrared1 - mode
	spectrograph2 - mode
	GroundStation3 - direction
	Star5 - direction
	Star4 - direction
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite1 Phenomenon10)
	(have_image Planet6 spectrograph2)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 infrared1)
	(have_image Star12 spectrograph2)
	(have_image Phenomenon13 thermograph0)
	(have_image Planet14 infrared1)
	(have_image Star15 thermograph0)
	(have_image Planet16 thermograph0)
	(have_image Phenomenon17 infrared1)
	(have_image Star18 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 14
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 14
3. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 14
4. (turn_to satellite1 planet14 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet14)
   goals met: 0 of 14
5. (take_image satellite1 planet14 instrument2 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 1 of 14
6. (turn_to satellite1 planet11 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet11)
   goals met: 1 of 14
7. (take_image satellite1 planet11 instrument2 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 2 of 14
8. (turn_to satellite1 phenomenon7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 14
9. (take_image satellite1 phenomenon7 instrument2 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 3 of 14
10. (turn_to satellite1 phenomenon17 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon17)
   goals met: 3 of 14
11. (take_image satellite1 phenomenon17 instrument2 infrared1)
   added: (have_image phenomenon17 infrared1)
   goals met: 4 of 14
12. (turn_to satellite1 phenomenon13 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 14
13. (take_image satellite1 phenomenon13 instrument2 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 5 of 14
14. (turn_to satellite1 planet16 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet16)
   goals met: 5 of 14
15. (take_image satellite1 planet16 instrument2 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 6 of 14
16. (turn_to satellite1 planet6 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet6)
   goals met: 6 of 14
17. (take_image satellite1 planet6 instrument2 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 7 of 14
18. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 7 of 14
19. (take_image satellite1 planet8 instrument2 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 8 of 14
20. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 8 of 14
21. (take_image satellite1 planet9 instrument2 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 9 of 14
22. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 9 of 14
23. (take_image satellite1 star12 instrument2 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 10 of 14
24. (turn_to satellite1 star15 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star15)
   goals met: 10 of 14
25. (take_image satellite1 star15 instrument2 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 11 of 14
26. (turn_to satellite1 star18 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star18)
   goals met: 11 of 14
27. (take_image satellite1 star18 instrument2 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 12 of 14
28. (turn_to satellite1 phenomenon10 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 phenomenon10)
   goals met: 13 of 14
29. (take_image satellite1 phenomenon10 instrument2 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 14 of 14
